#+TITLE: shell中如何将其他进制数转换成10进制数
#+AUTHOR: lujun9972
#+TAGS: linux和它的小伙伴,shell
#+DATE: [2018-12-18 二 20:09]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

* 使用bc
通过给bc设置 =obase(输出的基数)= 和 =ibase(输入的基数)=,可以进行任何进制的转换:
#+BEGIN_SRC shell :var num="A"
  echo "obase=10;ibase=16;$num" |bc
#+END_SRC

#+RESULTS:
: 10

* 通过基数表示法转换
在shell中，以 0 为前导的常量被当作八进制数，以 0x 或 0X 作为前导表明是十六进制。
其他情况下，数字的形式是 =[base#]n= ,这里 =base= 是一个 2 到 64 的十进制数值，作为数字的基数，n 是在这个基数中数字的值。

#+BEGIN_SRC shell :var num="C" 
  echo $((16#$num))
  echo $((0X$num))
#+END_SRC

#+RESULTS:
| 12 |
| 12 |
